/* Задайте значение N. Напишите программу, которая выведет все 
натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.

N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1" */

int GetNumber(string message)
{
    int result = 0;

    while(true)
    {
        Console.WriteLine(message);

        if(int.TryParse(Console.ReadLine(), out result))
        {
            break;
        }
        else
        {
            Console.WriteLine("Ввели не число. Повторите ввод");
        }
    }

    return result;
}

void PrintNumbers(int num)
{
    if (num==1) Console.Write("1");
    else 
    {
        Console.Write($"{num}, ");
        PrintNumbers(num-1);
    }
}

int number=GetNumber("Введите натуральное число");
PrintNumbers(number);
